# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# 
# Пример:
# 
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

a = [1, 2, 3, 4, 5, 6, 7]
for i in range(0, (len(a)+1)//2):
    print (f'{a[i]} * {a[-(i+1)]} = {a[i] * a[-(i+1)]}')